<template>

<b-dropdown text="시김새" class='m-1' dropup>
  <b-container>
    <b-row role="group" v-for='(group, i) in SYMBOL' :key='i'>
      <b-col class='p-0' v-for='(obj, j) in group' :key='j'>
        <b-dropdown-item-btn
        class='gugak px-2' @click="write(obj)"
        :aria-label="obj.label">
          <span aria-hidden='true'>{{ obj.text }}</span>
        </b-dropdown-item-btn>
      </b-col>
    </b-row>
  </b-container>
</b-dropdown>

</template>

<script>
export default {
  data: () => ({// Focusable??
    // ∞ 등의 추가 지원 필요
    SYMBOL: [
      [{"text":"없애기"}],
      [{"text":"𝆔43","label":"4, 3, 제 음의 한 음 위, 제 음","pitch":"43"},{"text":"𝆔53","label":"5, 3, 제 음의 두 음 위, 제 음","pitch":"53"},{"text":"𝆔63","label":"6, 3, 제 음의 세 음 위, 제 음","pitch":"63"}],
      [{"text":"𝆔23","label":"2, 3, 제 음의 한 음 아래, 제 음","pitch":"23"},{"text":"𝆔13","label":"1, 3, 제 음의 두 음 아래, 제 음","pitch":"13"},{"text":"𝆔03","label":"0, 3, 제 음의 세 음 아래, 제 음","pitch":"03"}],
      [{"text":"𝆔343","label":"3, 4, 3, 제 음, 제 음의 한 음 위, 제 음","pitch":"343"},{"text":"𝆔353","label":"3, 5, 3, 제 음, 제 음의 두 음 위, 제 음","pitch":"353"},{"text":"𝆔323","label":"3, 2, 3, 제 음, 제 음의 한 음 아래, 제 음","pitch":"323"},{"text":"𝆔313","label":"3, 1, 3, 제 음, 제 음의 두 음 아래, 제 음","pitch":"313"}],
      [{"text":"𝆔243","label":"2, 4, 3, 제 음의 한 음 아래, 제 음의 한 음 위, 제 음","pitch":"243"},{"text":"𝆔143","label":"1, 4, 3, 제 음의 두 음 아래, 제 음의 한 음 위, 제 음","pitch":"143"},{"text":"𝆔3243","label":"3, 2, 4, 3, 제 음, 제 음의 한 음 아래, 제 음의 한 음 위, 제 음","pitch":"3243"}],
      
      [{"pitch":"232","text":"I","label":"앞뒤 2, 제 음의 앞뒤로 제 음의 한 음 아래"},{"pitch":"323","text":"H","label":"앞뒤 4, 제 음의 앞뒤로 제 음의 한 음 위"}],
      [{"text":"343","tall":true,"label":"3, 4, 3, 균등, 제 음, 제 음의 한 음 위, 제 음을 균등하게","pitch":"343"},{"text":"323","tall":true,"label":"3, 2, 3, 균등, 제 음, 제 음의 한 음 아래, 제 음을 균등하게","pitch":"353"},{"text":"353","tall":true,"label":"3, 5, 3, 균등, 제 음, 제 음의 두 음 위, 제 음을 균등하게","pitch":"323"},{"text":"313","tall":true,"label":"3, 1, 3, 균등, 제 음, 제 음의 두 음 아래, 제 음을 균등하게","pitch":"313"}]],
  }),
  methods: {
    write(obj) {
      if (obj.pitch == null) obj = undefined;
      this.$emit('write', 'modifier', obj);
    },
  },
}
</script>
